Workspace/04-LES-rhoEnergyFoam-DLR-buffet-coarseMesh/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

libs (
   "libcompressibleTurbulenceModels.so"
   "libfindroot.so"
   "libhisaFiniteVolume.so"
//   "libvelocityOutletNSCBCx.so"
//   "libpressureOutletNSCBC.so"
//   "libtemperatureOutletNSCBC.so"
);

application     rhoEnergyFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         0.25;

deltaT          1e-8;

writeControl    adjustableRunTime;

writeInterval   0.5e-5;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   12;

runTimeModifiable true;

maxCo    0.25;

maxDeltaT       1e-5;

adjustTimeStep yes;

pressArtDiff    true; //activate artificial diffusion on pressure
convArtDiff     true; //activate artificial diffusion on pressure

ku        0.25;
kp        0.25;
ducLevelPress       0.00; // pressure diffusion threshold 
ducLevelConv        0.05; // convective diffusion threshold
epsilon             117649; // u_infty^2
minfty              1; // Reference Mach^2 number needed by AUSM flux (free stream Mach number)









functions
{
    #includeFunc MachNo
    #includeFunc yPlus
    #includeFunc writeCellCentres
    #includeFunc vorticity
    #includeFunc grad(p)
//    #includeFunc fieldAverage(U, p, prime2Mean = yes)
}
