Workspace/04-LES-rhoEnergyFoam-DLR-buffet-coarseMesh/constant/Cx
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "constant";
    object      Cx;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
97664
(
0.273506
0.270519
0.267535
0.264559
0.261592
0.258638
0.255697
0.252774
...
)
;

boundaryField
{
    PER_LEFT_1
    {
        type            cyclic;
    }
    PER_RIGHT_1
    {
        type            cyclic;
    }
    PER_LEFT_2
    {
        type            cyclic;
    }
    PER_RIGHT_2
    {
        type            cyclic;
    }
    PER_LEFT_3
    {
        type            cyclic;
    }
    PER_RIGHT_3
    {
        type            cyclic;
    }
    INLET
    {
        type            calculated;
        value           nonuniform List<scalar> 
144
(
-0.205
-0.205
-0.205
-0.205
-0.205
-0.205
-0.205
-0.205
...
)
;
    }
    OUTLET
    {
        type            calculated;
        value           nonuniform List<scalar> 
144
(
0.275
0.275
0.275
0.275
0.275
0.275
0.275
0.275
...
)
;
    }
    Blade
    {
        type            calculated;
        value           nonuniform List<scalar> 
504
(
6.22808e-05
9.03082e-05
0.000118364
0.000146374
0.000174187
0.000201655
0.000228629
0.000254978
...
)
;
    }
    back
    {
        type            empty;
    }
    front
    {
        type            empty;
    }
}


// ************************************************************************* //
