Workspace/04-LES-rhoEnergyFoam-DLR-buffet-coarseMesh/constant/Cz
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "constant";
    object      Cz;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
97664
(
-0.003
-0.003
-0.003
-0.003
-0.003
-0.003
-0.003
-0.003
...
)
;

boundaryField
{
    PER_LEFT_1
    {
        type            cyclic;
    }
    PER_RIGHT_1
    {
        type            cyclic;
    }
    PER_LEFT_2
    {
        type            cyclic;
    }
    PER_RIGHT_2
    {
        type            cyclic;
    }
    PER_LEFT_3
    {
        type            cyclic;
    }
    PER_RIGHT_3
    {
        type            cyclic;
    }
    INLET
    {
        type            calculated;
        value           nonuniform List<scalar> 
144
(
-0.003
-0.003
-0.003
-0.003
-0.003
-0.003
-0.003
-0.003
...
)
;
    }
    OUTLET
    {
        type            calculated;
        value           nonuniform List<scalar> 
144
(
-0.003
-0.003
-0.003
-0.003
-0.003
-0.003
-0.003
-0.003
...
)
;
    }
    Blade
    {
        type            calculated;
        value           nonuniform List<scalar> 
504
(
-0.003
-0.003
-0.003
-0.003
-0.003
-0.003
-0.003
-0.003
...
)
;
    }
    back
    {
        type            empty;
    }
    front
    {
        type            empty;
    }
}


// ************************************************************************* //
