Workspace/04-LES-rhoEnergyFoam-DLR-buffet-coarseMesh/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];


internalField   nonuniform List<vector> 
97664
(
(130.288 159.523 0)
(130.322 158.547 0)
(130.484 158.328 0)
(130.903 158.471 0)
(131.715 159.227 0)
(132.817 160.427 0)
(133.905 161.691 0)
(134.7 162.67 0)
...
)
;

boundaryField
{
    PER_LEFT_1
    {
        type            cyclic;
    }
    PER_RIGHT_1
    {
        type            cyclic;
    }
    PER_LEFT_2
    {
        type            cyclic;
    }
    PER_RIGHT_2
    {
        type            cyclic;
    }
    PER_LEFT_3
    {
        type            cyclic;
    }
    PER_RIGHT_3
    {
        type            cyclic;
    }
    INLET
    {
        type            freestreamVelocity;
        freestreamValue uniform (178.974 317.627 0);
        value           nonuniform List<vector> 
144
(
(183.083 317.604 0)
(183.093 317.62 0)
(183.104 317.638 0)
(183.115 317.656 0)
(183.128 317.671 0)
(183.14 317.683 0)
(183.154 317.696 0)
(183.167 317.708 0)
...
)
;
    }
    OUTLET
    {
        type            zeroGradient;
    }
    Blade
    {
        type            noSlip;
    }
    back
    {
        type            empty;
    }
    front
    {
        type            empty;
    }
}


// ************************************************************************* //
