Workspace/04-LES-rhoEnergyFoam-DLR-buffet-coarseMesh/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];


internalField   nonuniform List<scalar> 
97664
(
131340
131288
131274
131237
131207
131185
131170
131158
...
)
;

boundaryField
{
    PER_LEFT_1
    {
        type            cyclic;
    }
    PER_RIGHT_1
    {
        type            cyclic;
    }
    PER_LEFT_2
    {
        type            cyclic;
    }
    PER_RIGHT_2
    {
        type            cyclic;
    }
    PER_LEFT_3
    {
        type            cyclic;
    }
    PER_RIGHT_3
    {
        type            cyclic;
    }
    INLET
    {
        type            freestreamPressure;
        freestreamValue uniform 95950.3;
        value           nonuniform List<scalar> 
144
(
84836
84823.1
84807
84789.3
84774.1
84759.1
84741.7
84723.6
...
)
;
    }
    OUTLET
    {
        type            fixedMean;
        meanValue       constant 131179;
        value           nonuniform List<scalar> 
144
(
131346
131327
131307
131287
131267
131247
131227
131207
...
)
;
    }
    Blade
    {
        type            zeroGradient;
    }
    back
    {
        type            empty;
    }
    front
    {
        type            empty;
    }
}


// ************************************************************************* //
