Workspace/04-LES-rhoEnergyFoam-DLR-buffet-coarseMesh/0/Ret
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Ret;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];


internalField   nonuniform List<scalar> 
97664
(
269.457
265.206
262.602
260.798
260.629
260.746
260.154
250.463
...
)
;

boundaryField
{
    PER_LEFT_1
    {
        type            cyclic;
    }
    PER_RIGHT_1
    {
        type            cyclic;
    }
    PER_LEFT_2
    {
        type            cyclic;
    }
    PER_RIGHT_2
    {
        type            cyclic;
    }
    PER_LEFT_3
    {
        type            cyclic;
    }
    PER_RIGHT_3
    {
        type            cyclic;
    }
    INLET
    {
        type            fixedValue;
        value           uniform 800;
    }
    OUTLET
    {
        type            zeroGradient;
    }
    Blade
    {
        type            zeroGradient;
    }
    back
    {
        type            empty;
    }
    front
    {
        type            empty;
    }
}


// ************************************************************************* //
