Workspace/04-LES-rhoEnergyFoam-DLR-buffet-coarseMesh/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];


internalField   nonuniform List<scalar> 
97664
(
6979.33
7054.59
7130.86
7210.26
7292.72
7375.14
7455.89
7537.51
...
)
;

boundaryField
{
    PER_LEFT_1
    {
        type            cyclic;
    }
    PER_RIGHT_1
    {
        type            cyclic;
    }
    PER_LEFT_2
    {
        type            cyclic;
    }
    PER_RIGHT_2
    {
        type            cyclic;
    }
    PER_LEFT_3
    {
        type            cyclic;
    }
    PER_RIGHT_3
    {
        type            cyclic;
    }
    INLET
    {
        type            turbulentMixingLengthFrequencyInlet;
        mixingLength    1e-05;
        phi             phi;
        k               k;
        value           nonuniform List<scalar> 
144
(
4.09866e+06
4.09887e+06
4.09911e+06
4.09935e+06
4.09956e+06
4.09974e+06
4.09994e+06
4.10014e+06
...
)
;
    }
    OUTLET
    {
        type            zeroGradient;
    }
    Blade
    {
        blending        binomial2;
        n               2;
        beta1           0.075;
        type            omegaWallFunction;
        value           nonuniform List<scalar> 
504
(
3.57512e+07
3.38653e+07
3.44847e+07
3.51661e+07
3.60543e+07
3.69174e+07
3.81518e+07
3.91474e+07
...
)
;
    }
    back
    {
        type            empty;
    }
    front
    {
        type            empty;
    }
}


// ************************************************************************* //
