Workspace/04-LES-rhoEnergyFoam-DLR-buffet-coarseMesh/0/pMean
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      pMean;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
97664
(
130657
130513
130265
129901
130088
130524
130609
130961
...
)
;

boundaryField
{
    PER_LEFT_1
    {
        type            cyclic;
    }
    PER_RIGHT_1
    {
        type            cyclic;
    }
    PER_LEFT_2
    {
        type            cyclic;
    }
    PER_RIGHT_2
    {
        type            cyclic;
    }
    PER_LEFT_3
    {
        type            cyclic;
    }
    PER_RIGHT_3
    {
        type            cyclic;
    }
    INLET
    {
        type            calculated;
        value           nonuniform List<scalar> 
144
(
84116.1
83575.6
78452.6
78858.8
83652.8
82032.5
75932.8
76382.5
...
)
;
    }
    OUTLET
    {
        type            calculated;
        value           nonuniform List<scalar> 
144
(
130731
130724
130689
130704
130724
130686
130632
130575
...
)
;
    }
    Blade
    {
        type            calculated;
        value           nonuniform List<scalar> 
504
(
159031
159789
157969
154522
151897
148596
144765
141530
...
)
;
    }
    back
    {
        type            empty;
    }
    front
    {
        type            empty;
    }
}


// ************************************************************************* //
