Workspace/04-LES-rhoEnergyFoam-DLR-buffet-coarseMesh/0/rho
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      rho;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -3 0 0 0 0 0];


internalField   nonuniform List<scalar> 
97664
(
1.32071
1.31954
1.31919
1.31901
1.31951
1.32056
1.32173
1.32266
...
)
;

boundaryField
{
    PER_LEFT_1
    {
        type            cyclic;
    }
    PER_RIGHT_1
    {
        type            cyclic;
    }
    PER_LEFT_2
    {
        type            cyclic;
    }
    PER_RIGHT_2
    {
        type            cyclic;
    }
    PER_LEFT_3
    {
        type            cyclic;
    }
    PER_RIGHT_3
    {
        type            cyclic;
    }
    INLET
    {
        type            zeroGradient;
    }
    OUTLET
    {
        type            zeroGradient;
    }
    Blade
    {
        type            zeroGradient;
    }
    back
    {
        type            empty;
    }
    front
    {
        type            empty;
    }
}


// ************************************************************************* //
