Workspace/04-LES-rhoEnergyFoam-DLR-buffet-coarseMesh/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "(rho|rhoU|rhoE)"
    {
        solver          diagonal;
    }
    "(U|e|k|omega|Ret|im|nuTilda)"
    {
        solver          smoothSolver;
        smoother        GaussSeidel;
        nSweeps         2;
        tolerance       1e-9;
        relTol          0.01;
    }

    "(U|h|k|omega|Ret|im|nuTilda)Final"
    {
        $nuTilda;
        tolerance       1e-10;
        reltol          0;
        minIter         1;
    }

    yPsi
    {
        solver          GAMG;
        smoother        GaussSeidel;
        cacheAgglomeration true;
        nCellsInCoarsestLevel 10;
        agglomerator    faceAreaPair;
        mergeLevels     1;
        tolerance       1e-5;
        relTol          0;
    }
}

relaxationFactors
{
    equations
    {
        nuTilda         0.5;
        k               0.5;
        omega           0.5;
	Ret             0.5;
	im   0.5;
    }
}


// ************************************************************************* //
